IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_dcsm_common_regs.xml
<module id="DCSM_COMMON_REGS" HW_revision="" description="DCSM COMMON Registers">
	<register id="FLSEM" width="32" page="1" offset="0x0" internal="0" description="Flash Wrapper Semaphore Register">
		<bitfield id="SEM" description="Flash Semaphore Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Semaphore Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="SECTSTAT1" width="32" page="1" offset="0x8" internal="0" description="Flash Sectors Status Register 1">
		<bitfield id="STATUS_SECT0" description="Zone Status Flash Bank 0 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT1" description="Zone Status Flash Bank 0 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT2" description="Zone Status Flash Bank 0 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT3" description="Zone Status Flash Bank 0 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT4" description="Zone Status Flash Bank 0 Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT5" description="Zone Status Flash Bank 0 Sector 5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT6" description="Zone Status Flash Bank 0 Sector 6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT7" description="Zone Status Flash Bank 0 Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT8" description="Zone Status Flash Bank 0 Sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT9" description="Zone Status Flash Bank 0 Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT10" description="Zone Status Flash Bank 0 Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT11" description="Zone Status Flash Bank 0 Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT12" description="Zone Status Flash Bank 0 Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT13" description="Zone Status Flash Bank 0 Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT14" description="Zone Status Flash Bank 0 Sector 14" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT15" description="Zone Status Flash Bank 0 Sector 15" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT2" width="32" page="1" offset="0xa" internal="0" description="Flash Sectors Status Register 2">
		<bitfield id="STATUS_SECT16" description="Zone Status Flash Bank 0 Sector 16" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT17" description="Zone Status Flash Bank 0 Sector 17" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT18" description="Zone Status Flash Bank 0 Sector 18" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT19" description="Zone Status Flash Bank 0 Sector 19" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT20" description="Zone Status Flash Bank 0 Sector 20" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT21" description="Zone Status Flash Bank 0 Sector 21" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT22" description="Zone Status Flash Bank 0 Sector 22" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT23" description="Zone Status Flash Bank 0 Sector 23" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT24" description="Zone Status Flash Bank 0 Sector 24" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT25" description="Zone Status Flash Bank 0 Sector 25" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT26" description="Zone Status Flash Bank 0 Sector 26" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT27" description="Zone Status Flash Bank 0 Sector 27" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT28" description="Zone Status Flash Bank 0 Sector 28" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT29" description="Zone Status Flash Bank 0 Sector 29" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT30" description="Zone Status Flash Bank 0 Sector 30" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT31" description="Zone Status Flash Bank 0 Sector 31" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT3" width="32" page="1" offset="0xc" internal="0" description="Flash Sectors Status Register 3">
		<bitfield id="STATUS_SECT39_32" description="Zone Status flash Bank 0 Sectors 39-32" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT47_40" description="Zone Status flash Bank 0 Sectors 47-40" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT55_48" description="Zone Status flash Bank 0 Sectors 55-48" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT63_56" description="Zone Status flash Bank 0 Sectors 63-56" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT71_64" description="Zone Status flash Bank 0 Sectors 71-64" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT79_72" description="Zone Status flash Bank 0 Sectors 79-72" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT87_80" description="Zone Status flash Bank 0 Sectors 87-80" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT95_88" description="Zone Status flash Bank 0 Sectors 95-88" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT103_96" description="Zone Status flash Bank 0 Sectors 103-96" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT111_104" description="Zone Status flash Bank 0 Sectors 111-104" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT119_112" description="Zone Status flash Bank 0 Sectors 119-112" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT127_120" description="Zone Status flash Bank 0 Sectors 127-120" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT1" width="32" page="1" offset="0x10" internal="0" description="RAM Status Register 1">
		<bitfield id="STATUS_RAM0" description="Zone Status RAM LS0 Section A" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM1" description="Zone Status RAM LS0 Section B" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM2" description="Zone Status RAM LS0 Section C" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM3" description="Zone Status RAM LS0 Section D" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM4" description="Zone Status RAM LS1 Section A" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM LS1 Section B" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM LS1 Section C" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM LS1 Section D" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="SECERRSTAT" width="32" page="1" offset="0x18" internal="0" description="Security Error Status Register">
		<bitfield id="ERR" description="Security Configuration load Error Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="SECERRCLR" width="32" page="1" offset="0x1a" internal="0" description="Security Error Clear Register">
		<bitfield id="ERR" description="Clear Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SECERRFRC" width="32" page="1" offset="0x1c" internal="0" description="Security Error Force Register">
		<bitfield id="ERR" description="Set Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Valid Register Write Key" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="DENYCODE" width="32" page="1" offset="0x1e" internal="0" description="Flash Authorization Denial Code">
		<bitfield id="BLOCKED" description="Blocked Code" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ILLADDR" description="Illegal Address Code" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ILLPROG" description="Illegal Program Address" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ILLERASE" description="Illegal Erase Address" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ILLRDVER" description="Illegal Read Verify Address" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ILLMODECH" description="Illegal Mode Change" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ILLCMD" description="Illegal Command" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ILLSIZE" description="Illegal Command Size" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="RAMOPENSTAT" width="32" page="1" offset="0x20" internal="0" description="RAM Security Open Status Register">
		<bitfield id="RAMOPEN" description="RAM Security Open" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="RAMOPENFRC" width="32" page="1" offset="0x22" internal="0" description="RAM Security Open Force Register">
		<bitfield id="SET" description="Set RAM Open request" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Valid Write KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RAMOPENCLR" width="32" page="1" offset="0x24" internal="0" description="RAM Security Open Clear Register">
		<bitfield id="CLEAR" description="Clear RAM Open request" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Valid Write KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RAMOPENLOCK" width="32" page="1" offset="0x26" internal="0" description="RAMOPEN Lock Register">
		<bitfield id="LOCK" description="RAMOPEN Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
